# # Примеры
#
# На этой странице мы делаем `include` примеров,
# которые лежат в корневом каталоге пакета в папке `"examples/"`.
#
# [Literate.jl](https://github.com/fredrikekre/Literate.jl) включает
# текст этих примеров и в md файл.
#
#

#jl ############################################################################
#jl ############################################################################
#jl ############################################################################
include("example_direct.jl")

# ### Визуализация

# Мы не можем строить большие анимации на стороне Travis-a.
# Если мы на CI, то будем рисовать только 10 кадров.
# Если мы генерируем документацию локально, то рисуем 80 кадров.
isTravis = in("Travis", keys(ENV))
ftw = isTravis ? range(1, stop = M+1, length=9) : [1; 2:div(M+1, 80):M+1];

# Запись gif одного только решения
make_gif(u, XX, Tₘ; name="direct_example.gif", frames_to_write = ftw)

# Запись **только** mp4 вместе с вырожденными корнями и переходным слоем.
make_gif(u, XX, Tₘ, ϕl, ϕr, ϕ, f1_data, f2_data;
         name="direct_with_f1_f2_example.mp4", frames_to_write = ftw)
#jl ###########################################################################


#jl ###########################################################################
#jl ###########################################################################
#jl ###########################################################################
include("example_direct_dparams.jl")

# Так выглядит решение для стандартных данных.
make_gif(u, XX, Tₘ, ϕl, ϕr, ϕ, f1_data, f2_data; name="direct_with_f1_f2_example.gif", frames_to_write = ftw)
#jl ###########################################################################


#jl ###########################################################################
#jl ###########################################################################
#jl ###########################################################################
include("example_direct_nonuniform.jl")

# Так выглядит решение для стандартных данных.
ftw = [1; 2:div(M+1, 80):M+1];
make_gif(u, XX, Tₘ, ϕl, ϕr, ϕ, f1_data, f2_data; name="direct_with_f1_f2_example.gif", frames_to_write = ftw)
#jl ###########################################################################


#jl ###########################################################################
#jl ###########################################################################
#jl ###########################################################################
include("example_direct_nonuniform_dparams.jl")

# Так выглядит решение для стандартных данных динамической сетке.
ftw = [1; 2:div(M+1, 80):M+1];
make_gif(u, XX, Tₘ, ϕl, ϕr, ϕ, f1_data, f2_data; name="direct_with_f1_f2_example.gif", frames_to_write = ftw)
#jl ###########################################################################
